# <span style='color:purple'> Car Prices One Hot Encoding.

In [41]:
import pandas as pd
import numpy as np
import warnings 
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('carprices.csv')
df

         Car Model  Mileage  Sell Price  Age
0           BMW X5    69000       18000    6
1           BMW X5    35000       34000    3
2           BMW X5    57000       26100    5
3           BMW X5    22500       40000    2
4           BMW X5    46000       31500    4
5             Audi    59000       29400    5
6             Audi    52000       32000    5
7             Audi    72000       19300    6
8             Audi    91000       12000    8
9   Mercedez Benz     67000       22000    6
10  Mercedez Benz     83000       20000    7
11  Mercedez Benz     79000       21000    7
12  Mercedez Benz     59000       33000    5
13          Toyota    51000       42000    4
14          Toyota    65000       32000    7
15          Toyota    39000       55000    5

In [3]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [4]:
df['Car Model_n'] = le.fit_transform(df['Car Model'])
df

         Car Model  Mileage  Sell Price  Age  Car Model_n
0           BMW X5    69000       18000    6            1
1           BMW X5    35000       34000    3            1
2           BMW X5    57000       26100    5            1
3           BMW X5    22500       40000    2            1
4           BMW X5    46000       31500    4            1
5             Audi    59000       29400    5            0
6             Audi    52000       32000    5            0
7             Audi    72000       19300    6            0
8             Audi    91000       12000    8            0
9   Mercedez Benz     67000       22000    6            2
10  Mercedez Benz     83000       20000    7            2
11  Mercedez Benz     79000       21000    7            2
12  Mercedez Benz     59000       33000    5            2
13          Toyota    51000       42000    4            3
14          Toyota    65000       32000    7            3
15          Toyota    39000       55000    5            3

In [6]:
X = df.drop(['Car Model','Sell Price'],axis=1)
X

    Mileage  Age  Car Model_n
0     69000    6            1
1     35000    3            1
2     57000    5            1
3     22500    2            1
4     46000    4            1
5     59000    5            0
6     52000    5            0
7     72000    6            0
8     91000    8            0
9     67000    6            2
10    83000    7            2
11    79000    7            2
12    59000    5            2
13    51000    4            3
14    65000    7            3
15    39000    5            3

In [7]:
y = df[['Sell Price']]
y

    Sell Price
0        18000
1        34000
2        26100
3        40000
4        31500
5        29400
6        32000
7        19300
8        12000
9        22000
10       20000
11       21000
12       33000
13       42000
14       32000
15       55000

In [8]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [9]:
len(X_train)

12

In [10]:
len(X_test)

4

In [11]:
len(df)

16

In [35]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [36]:
model.fit(X_train,y_train)

LinearRegression()

# Find the sell price of BMW X5 whose Mileage= 45000km and Age= 8

In [37]:
model.predict([[45000,8,1]])

array([[44763.32089809]])

# Find the sell price of Toyota whose Mileage= 15000km and Age= 5

In [38]:
model.predict([[15000,5,3]])

array([[64825.00478769]])

# Find the score of the model

In [40]:
model.score(X_test,y_test)

0.7717034026088756